---
kind: other
id: Methods.T:Autodesk.Revit.DB.IExternalDBApplication
source: html/fa6f9b0d-c4bf-9d6f-e601-105819a1543a.htm
---
# IExternalDBApplication Methods

Implement this method to execute some tasks when Autodesk Revit shuts down.